package com.javarush.task.task09.task0927;

import java.util.*;

/* 
Десять котов
Есть класс кот - Cat, с полем "имя" (String).
Создать словарь Map<String, Cat> и добавить туда 10 котов в виде "Имя"-"Кот".
Получить из Map множество(Set) всех котов и вывести его на экран.

Требования:
1. Программа не должна считывать данные с клавиатуры.
2. Метод createMap должен создавать новый объект HashMap<String, Cat>.
3. Метод createMap должен добавлять в словарь 10 котов в виде «Имя»-«Кот».
4. Метод createMap должен возвращать созданный словарь.
5. Метод convertMapToSet должен создать и вернуть множество котов, полученных из переданного словаря.
6. Программа должна вывести всех котов из множества на экран.
*/

public class Solution {
    public static void main(String[] args) {
        Map<String, Cat> map = createMap();
        Set<Cat> set = convertMapToSet(map);
        printCatSet(set);
    }

    public static Map<String, Cat> createMap() {
        //напишите тут ваш код
        Map<String,Cat> maps = new HashMap<String, Cat>();
        maps.put("Vaska1", new Cat("Vaska1") );
        maps.put("Vaska2", new Cat("Vaska2") );
        maps.put("Vaska3", new Cat("Vaska3") );
        maps.put("Vaska4", new Cat("Vaska4") );
        maps.put("Vaska5", new Cat("Vaska5") );
        maps.put("Vaska6", new Cat("Vaska6") );
        maps.put("Vaska7", new Cat("Vaska7") );
        maps.put("Vaska8", new Cat("Vaska8") );
        maps.put("Vaska9", new Cat("Vaska9") );
        maps.put("Vaska10", new Cat("Vaska10") );
        return maps;
    }

    public static Set<Cat> convertMapToSet(Map<String, Cat> map) {
        //напишите тут ваш код
        Set<Cat> cats = new HashSet<>(map.values());
        return cats;
    }

    public static void printCatSet(Set<Cat> set) {
        for (Cat cat : set) {
            System.out.println(cat);
        }
    }

    public static class Cat {
        private String name;

        public Cat(String name) {
            this.name = name;
        }

        public String toString() {
            return "Cat " + this.name;
        }
    }


}
